OFMesh_test/0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.141131;

boundaryField
{
    inlet1
    {
        type            calculated;
        value           uniform 0.141131;
    }
    top
    {
        type            calculated;
        value           uniform 0.141131;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.141131;
    }
    bottom
    {
        type            symmetryPlane;
    }
    nozzle
    {
        type            calculated;
        value           nonuniform List<scalar> 
230
(
0.097816
0.0937465
0.0895325
0.0851804
0.0806969
0.0760891
0.0713639
0.0665286
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
